zephyrproject-rtos/zephyr/drivers/timer/stm32_lptim_timer.c
/*
 * Copyright (c) 2018 Foundries.io Ltd
 * Copyright (c) 2019 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/init.h>
#include <soc.h>
#include <stm32_ll_lptim.h>
#include <stm32_ll_bus.h>
#include <stm32_ll_exti.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_pwr.h>
#include <stm32_ll_system.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/timer/system_timer.h>
#include <zephyr/sys/clock.h>
#include <zephyr/irq.h>
#include <zephyr/drivers/counter.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/pm/policy.h>

#include <zephyr/spinlock.h>

/* Define for grep-ability, even though this will not be used */
#define DT_DRV_COMPAT st_stm32_lptim

#define LPTIM_SYSTIMER_NODE DT_CHOSEN(zephyr_system_timer)

#if DT_NUM_CLOCKS(LPTIM_SYSTIMER_NODE) <= 1
#error "LPTIM source clock must be provided in Device Tree"
#endif

#define LPTIM ((LPTIM_TypeDef *)DT_REG_ADDR(LPTIM_SYSTIMER_NODE))

#if defined(CONFIG_SOC_SERIES_STM32MP1X)
#define LL_LPTIM_ClearFlag_ARRM  LL_LPTIM_ClearFLAG_ARRM
#define LL_LPTIM_ClearFlag_CMPM  LL_LPTIM_ClearFLAG_CMPM
#endif /* CONFIG_SOC_SERIES_STM32MP1X */

#if defined(CONFIG_STM32_HAL2)
#define STM32_LPTIM_OCPOLARITY_HIGH    LL_LPTIM_OCPOLARITY_HIGH
#define STM32_LPTIM_OCPOLARITY_LOW     LL_LPTIM_OCPOLARITY_LOW
#define STM32_LPTIM_PRELOAD_DISABLED   LL_LPTIM_PRELOAD_DISABLED
#define STM32_LPTIM_PRELOAD_ENABLED    LL_LPTIM_PRELOAD_ENABLED
#else /* CONFIG_STM32_HAL2 */
#define STM32_LPTIM_OCPOLARITY_HIGH    LL_LPTIM_OUTPUT_POLARITY_REGULAR
#define STM32_LPTIM_OCPOLARITY_LOW     LL_LPTIM_OUTPUT_POLARITY_INVERSE
#define STM32_LPTIM_PRELOAD_DISABLED   LL_LPTIM_UPDATE_MODE_IMMEDIATE
#define STM32_LPTIM_PRELOAD_ENABLED    LL_LPTIM_UPDATE_MODE_ENDOFPERIOD
#endif /* CONFIG_STM32_HAL2 */

static const struct stm32_pclken lptim_clk[] = STM32_DT_CLOCKS(LPTIM_SYSTIMER_NODE);

static const struct device *const clk_ctrl = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

static const struct reset_dt_spec lptim_reset = RESET_DT_SPEC_GET(LPTIM_SYSTIMER_NODE);

/*
 * Assumptions and limitations:
 *
 * - system clock based on an LPTIM instance, clocked by LSI or LSE
 * - prescaler is set to a 2^value from 1 (division of the LPTIM source clock by 1)
 *   to 128 (division of the LPTIM source clock by 128)
 * - using LPTIM AutoReload capability to trig the IRQ (timeout irq)
 * - when timeout irq occurs the counter is already reset
 * - the maximum timeout duration is reached with the lptim_time_base value
 * - with prescaler of 1, the max timeout (LPTIM_TIMEBASE) is 2 seconds:
 *    0xFFFF / (LSE freq (32768Hz) / 1)
 * - with prescaler of 128, the max timeout (LPTIM_TIMEBASE) is 256 seconds:
 *    0xFFFF / (LSE freq (32768Hz) / 128)
 */

static int32_t lptim_time_base;
static uint32_t lptim_clock_freq = CONFIG_STM32_LPTIM_CLOCK;
/* The prescaler given by the DTS and to apply to the lptim_clock_freq */
static uint32_t lptim_clock_presc = DT_PROP(LPTIM_SYSTIMER_NODE, st_prescaler);

/* Minimum nb of clock cycles to have to set autoreload register correctly */
#define LPTIM_GUARD_VALUE 2

/* A 32bit value cannot exceed 0xFFFFFFFF/LPTIM_TIMEBASE counting cycles.
 * This is for example about of 65000 x 2000ms when clocked by LSI
 */
static uint32_t accumulated_lptim_cnt;
/* Next autoreload value to set */
static uint32_t autoreload_next;
/* Indicate if the autoreload register is ready for a write */
static bool autoreload_ready = true;

static struct k_spinlock lock;

#ifdef CONFIG_STM32_LPTIM_STDBY_TIMER

#define cycle_t uint32_t

/* This local variable indicates that the timeout was set right before
 * entering standby state.
 *
 * It is used for chips that has to use a separate standby timer in such
 * case because the LPTIM is not clocked in some low power mode state.
 */
static bool timeout_stdby;

/* Cycle counter before entering the standby state. */
static cycle_t lptim_cnt_pre_stdby;

/* Standby timer value before entering the standby state. */
static uint32_t stdby_timer_pre_stdby;

/* Standby timer used for timer while entering the standby state */
static const struct device *stdby_timer = DEVICE_DT_GET(DT_CHOSEN(st_lptim_stdby_timer));

#endif /* CONFIG_STM32_LPTIM_STDBY_TIMER */

/**
 * @brief Enable autonomous clock for the LPTIM instance in use
 *
 * Enables autonomous mode (if supported) for whichever LPTIM instance
 * is configured as the system timer. This allows the LPTIM to continue
 * running in low power modes.
 */
static void lptim_enable_autonomous_mode(void)
{
	const uint32_t lptim_base = (uint32_t)LPTIM;

	switch (lptim_base) {
#if DT_NODE_EXISTS(DT_NODELABEL(lptim1)) && defined(LL_SRDAMR_GRP1_PERIPH_LPTIM1AMEN)
	case DT_REG_ADDR(DT_NODELABEL(lptim1)):
		LL_SRDAMR_GRP1_EnableAutonomousClock(LL_SRDAMR_GRP1_PERIPH_LPTIM1AMEN);
		break;
#endif
#if DT_NODE_EXISTS(DT_NODELABEL(lptim3)) && defined(LL_SRDAMR_GRP1_PERIPH_LPTIM3AMEN)
	case DT_REG_ADDR(DT_NODELABEL(lptim3)):
		LL_SRDAMR_GRP1_EnableAutonomousClock(LL_SRDAMR_GRP1_PERIPH_LPTIM3AMEN);
		break;
#endif
#if DT_NODE_EXISTS(DT_NODELABEL(lptim4)) && defined(LL_SRDAMR_GRP1_PERIPH_LPTIM4AMEN)
	case DT_REG_ADDR(DT_NODELABEL(lptim4)):
		LL_SRDAMR_GRP1_EnableAutonomousClock(LL_SRDAMR_GRP1_PERIPH_LPTIM4AMEN);
		break;
#endif
	default:
		/* Note: LPTIM2, LPTIM5, LPTIM6 do not support autonomous mode */
		break;
	}
}

/**
 * @brief Freeze LPTIM during debug for the instance in use
 *
 * Configures the debug subsystem to freeze the LPTIM counter when the CPU
 * is halted in a debugger. Handles all LPTIM instances across different buses.
 */
static void lptim_freeze_during_debug(void)
{
#ifdef CONFIG_DEBUG
	const uint32_t lptim_base = (uint32_t)LPTIM;

	switch (lptim_base) {
		/* LPTIM1 - can be on APB1_GRP1, APB3_GRP1, or APB7_GRP1 */
#if DT_NODE_EXISTS(DT_NODELABEL(lptim1))
	case DT_REG_ADDR(DT_NODELABEL(lptim1)):
#if defined(LL_DBGMCU_APB1_GRP1_LPTIM1_STOP)
		LL_DBGMCU_APB1_GRP1_FreezePeriph(LL_DBGMCU_APB1_GRP1_LPTIM1_STOP);
#elif defined(LL_DBGMCU_APB3_GRP1_LPTIM1_STOP)
		LL_DBGMCU_APB3_GRP1_FreezePeriph(LL_DBGMCU_APB3_GRP1_LPTIM1_STOP);
#elif defined(LL_DBGMCU_APB7_GRP1_LPTIM1_STOP)
		LL_DBGMCU_APB7_GRP1_FreezePeriph(LL_DBGMCU_APB7_GRP1_LPTIM1_STOP);
#endif
		break;
#endif
		/* LPTIM2 - can be on APB1_GRP1, APB1_GRP2, APB3_GRP1, or APB4_GRP1 */
#if DT_NODE_EXISTS(DT_NODELABEL(lptim2))
	case DT_REG_ADDR(DT_NODELABEL(lptim2)):
#if defined(LL_DBGMCU_APB1_GRP1_LPTIM2_STOP)
		LL_DBGMCU_APB1_GRP1_FreezePeriph(LL_DBGMCU_APB1_GRP1_LPTIM2_STOP);
#elif defined(LL_DBGMCU_APB1_GRP2_LPTIM2_STOP)
		LL_DBGMCU_APB1_GRP2_FreezePeriph(LL_DBGMCU_APB1_GRP2_LPTIM2_STOP);
#elif defined(LL_DBGMCU_APB3_GRP1_LPTIM2_STOP)
		LL_DBGMCU_APB3_GRP1_FreezePeriph(LL_DBGMCU_APB3_GRP1_LPTIM2_STOP);
#elif defined(LL_DBGMCU_APB4_GRP1_LPTIM2_STOP)
		LL_DBGMCU_APB4_GRP1_FreezePeriph(LL_DBGMCU_APB4_GRP1_LPTIM2_STOP);
#endif
		break;
#endif
		/* LPTIM3 - can be on APB1_GRP2, APB3_GRP1, or APB4_GRP1 */
#if DT_NODE_EXISTS(DT_NODELABEL(lptim3))
	case DT_REG_ADDR(DT_NODELABEL(lptim3)):
#if defined(LL_DBGMCU_APB1_GRP2_LPTIM3_STOP)
		LL_DBGMCU_APB1_GRP2_FreezePeriph(LL_DBGMCU_APB1_GRP2_LPTIM3_STOP);
#elif defined(LL_DBGMCU_APB3_GRP1_LPTIM3_STOP)
		LL_DBGMCU_APB3_GRP1_FreezePeriph(LL_DBGMCU_APB3_GRP1_LPTIM3_STOP);
#elif defined(LL_DBGMCU_APB4_GRP1_LPTIM3_STOP)
		LL_DBGMCU_APB4_GRP1_FreezePeriph(LL_DBGMCU_APB4_GRP1_LPTIM3_STOP);
#endif
		break;
#endif
		/* LPTIM4 - can be on APB3_GRP1 or APB4_GRP1 */
#if DT_NODE_EXISTS(DT_NODELABEL(lptim4))
	case DT_REG_ADDR(DT_NODELABEL(lptim4)):
#if defined(LL_DBGMCU_APB3_GRP1_LPTIM4_STOP)
		LL_DBGMCU_APB3_GRP1_FreezePeriph(LL_DBGMCU_APB3_GRP1_LPTIM4_STOP);
#elif defined(LL_DBGMCU_APB4_GRP1_LPTIM4_STOP)
		LL_DBGMCU_APB4_GRP1_FreezePeriph(LL_DBGMCU_APB4_GRP1_LPTIM4_STOP);
#endif
		break;
#endif
		/* LPTIM5 - can be on APB3_GRP1 or APB4_GRP1 */
#if DT_NODE_EXISTS(DT_NODELABEL(lptim5))
	case DT_REG_ADDR(DT_NODELABEL(lptim5)): {
#if defined(LL_DBGMCU_APB3_GRP1_LPTIM5_STOP)
		LL_DBGMCU_APB3_GRP1_FreezePeriph(LL_DBGMCU_APB3_GRP1_LPTIM5_STOP);
#elif defined(LL_DBGMCU_APB4_GRP1_LPTIM5_STOP)
		LL_DBGMCU_APB4_GRP1_FreezePeriph(LL_DBGMCU_APB4_GRP1_LPTIM5_STOP);
#endif
	}
#endif
	/* LPTIM6 - on APB3_GRP1 */
#if DT_NODE_EXISTS(DT_NODELABEL(lptim6))
	case DT_REG_ADDR(DT_NODELABEL(lptim6)):
#if defined(LL_DBGMCU_APB3_GRP1_LPTIM6_STOP)
		LL_DBGMCU_APB3_GRP1_FreezePeriph(LL_DBGMCU_APB3_GRP1_LPTIM6_STOP);
#endif
		break;
#endif
	default:
		break;
	}
#endif /* CONFIG_DEBUG */
}

static inline bool arrm_state_get(void)
{
	return (LL_LPTIM_IsActiveFlag_ARRM(LPTIM) && LL_LPTIM_IsEnabledIT_ARRM(LPTIM));
}

static void lptim_irq_handler(const struct device *unused)
{

